In [11]:
import pandas as pd

In [12]:
train = pd.read_csv("/Users/hellothere/choi/07.study/dsschool/01.data/titanic/train.csv", index_col="PassengerId")
test = pd.read_csv("/Users/hellothere/choi/07.study/dsschool/01.data/titanic/test.csv", index_col="PassengerId")

In [15]:
train.head(5)
test.head(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [17]:
print(train.shape)
print(test.shape)

(891, 11)
(418, 10)

In [16]:
test.head(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# PreProcessing

# Encode Sex

In [25]:
train.loc[train["Sex"] == "male","Sex"]   = 0
train.loc[train["Sex"] == "female","Sex"] = 1
test.loc[test["Sex"] == "male","Sex"]   = 0
test.loc[test["Sex"] == "female","Sex"] = 1

In [27]:
test.head(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,S

# Fillin Missing Fare

In [32]:
test.loc[test["Fare"].isnull() ,"Fare"] = 0

In [34]:
test.loc[test["Fare"].isnull()]

Empty DataFrame
Columns: [Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

# Encode Enbarked

In [43]:
# C ==0 , S == 1 , Q == 2 
# 2 * 2 = Q? 
# S + S = Q ? 
# One Hot Encoding

# C = [ 1, 0 , 0 ]
# S = [ 0, 1 , 0 ]
# Q = [ 0, 0 , 1 ]

# C = [ True , False , False ]
# S = [ False , True , False ]
# Q = [ False, False , True ]

train["Embarked_C"]  = train["Embarked"] == "C" 
train["Embarked_S"]  = train["Embarked"] == "S" 
train["Embarked_Q"]  = train["Embarked"] == "Q" 

print(train.shape)

train[["Embarked","Embarked_C","Embarked_S","Embarked_Q"]].head(5)

(891, 14)

            Embarked  Embarked_C  Embarked_S  Embarked_Q
PassengerId
1                  S       False        True       False
2                  C        True       False       False
3                  S       False        True       False
4                  S       False        True       False
5                  S       False        True       False

In [45]:
test["Embarked_C"]  = test["Embarked"] == "C" 
test["Embarked_S"]  = test["Embarked"] == "S" 
test["Embarked_Q"]  = test["Embarked"] == "Q" 

print(test.shape)

test[["Embarked","Embarked_C","Embarked_S","Embarked_Q"]].head(5)

(418, 13)

            Embarked  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892                Q       False       False        True
893                S       False        True       False
894                Q       False       False        True
895                S       False        True       False
896                S       False        True       False

In [46]:
train.tail(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked_C,Embarked_S,Embarked_Q
PassengerId,,,,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.00,NaN,S,False,True,False
888,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.00,B42,S,False,True,False
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.45,NaN,S,False,True,False
890,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.00,C148,C,True,False,False
891,0,3,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.75,NaN,Q,False,False,True

In [48]:
print(test.shape)
print(train.shape)

(418, 13)
(891, 14)

# Train

In [50]:
feature_names = ["Pclass","Sex","Fare","Embarked_C","Embarked_S","Embarked_Q"]
feature_names

['Pclass', 'Sex', 'Fare', 'Embarked_C', 'Embarked_S', 'Embarked_Q']

In [54]:
train[feature_names].head(5)
X_train = train[feature_names]
X_train.head()

             Pclass Sex     Fare  Embarked_C  Embarked_S  Embarked_Q
PassengerId
1                 3   0   7.2500       False        True       False
2                 1   1  71.2833        True       False       False
3                 3   1   7.9250       False        True       False
4                 1   1  53.1000       False        True       False
5                 3   0   8.0500       False        True       False

In [55]:
test[feature_names].head(5)
X_test = test[feature_names]
X_test.head()

             Pclass Sex     Fare  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892               3   0   7.8292       False       False        True
893               3   1   7.0000       False        True       False
894               2   0   9.6875       False       False        True
895               3   0   8.6625       False        True       False
896               3   1  12.2875       False        True       False

In [59]:
label_name =  "Survived"
y_train = train[label_name]
print(y_train.shape)
y_train.head()

(891,)

PassengerId
1    0
2    1
3    1
4    1
5    0
Name: Survived, dtype: int64

In [64]:
# scikit-learn  == sklearn
from sklearn.tree  import DecisionTreeClassifier
model  = DecisionTreeClassifier(max_depth=5)
model

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=5,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [65]:
# fit / predict 
model.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=5,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [67]:
model.predict(X_test)

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0,
       1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1,
       0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0,
       1, 0, 0, 0])

In [69]:
print(model.score)

<bound method ClassifierMixin.score of DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=5,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')>

In [71]:
predictions = model.predict(X_test)
print(predictions.shape)
predictions[0:10]

(418,)

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0])

# Submit

In [74]:
submit = pd.read_csv("/Users/hellothere/choi/07.study/dsschool/01.data/titanic/gender_submission.csv", index_col="PassengerId")

In [78]:
submit["Survived"] = predictions

In [79]:
submit.head()

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 1

In [81]:
submit.to_csv("/Users/hellothere/choi/07.study/dsschool/01.data/titanic/submit.csv")